# 판다스 시작 - 파일을 DataFrame으로 로딩, 기본 API

In [8]:
import pandas as pd

## read_csv()

In [9]:
titanic_df = pd.read_csv('C:\\Users\\jjku0\\OneDrive\\data\\titanic\\train.csv')
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [10]:
print(type(titanic_df))
titanic_df

<class 'pandas.core.frame.DataFrame'>

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [11]:
print(titanic_df.shape)  # 891개의 로우와 12개의 컬럼

(891, 12)

## info()

In [12]:
titanic_df.info()  # 총 데이터 건수와 데이터 타입, Null 건수를 알 수 있다.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

## describe()

In [17]:
titanic_df.describe()  # 숫자형 칼럼의 분포도만 조사하며 자동으로 object 타입의 컬럼은 출력에서 제외

# count : Not Null인 데이터 건수
# mean : 전체 데이터의 평균값
# std : 표준편차
# min : 최솟값
# max : 최대값
# 25% : 25 percentile 값
# 50% : 50 percentile 값
# 75% : 75 percentile 값

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

## value_counts()

In [18]:
value_counts = titanic_df['Pclass'].value_counts()  # 데이터의 분포도 확인
print(value_counts)  # 많은 건수 순서로 정렬되어 값을 반환

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [19]:
titanic_pclass = titanic_df['Pclass']
print(type(titanic_pclass))

<class 'pandas.core.series.Series'>

In [20]:
titanic_pclass.head()  # Series의 Index, 데이터 출력

0    3
1    1
2    3
3    1
4    3
Name: Pclass, dtype: int64

In [21]:
print(type(value_counts))
print(value_counts)

<class 'pandas.core.series.Series'>
3    491
1    216
2    184
Name: Pclass, dtype: int64

위에서 출력된 인덱스는 단순히 0부터 시작하는 순차 값이 아니다. Pclass 컬럼 값이 3, 1, 2를 나타내고 있다.  
이처럼 인덱스는 단순히 순차 값과 같은 의미 없는 식별자만 할당하는 것이 아니라 고유성이 보정된다면 의미 있는 데이터 값 할당도 가능하다.  
value_count()는 컬럼 값별 데이터 건수를 반환하므로 고유 컬럼 값을 식별자로 사용할 수 있다.  
인덱스는 DataFrame, Series가 만들어진 후에도 변경할 수 있다.  
인덱스는 또한 숫자형뿐만 아니라 문자열도 가능하다. 단, 모든 인덱스는 고유성이 보장돼야 한다.

# DataFrame과 리서트, 딕셔너리, 넘파이 ndarray 상호 변환

## 넘파이 ndarray, 리스트, 딕셔너리를 DataFrame으로 변환하기

In [22]:
import numpy as np

col_name1 = ['col1']
list1 = [1, 2, 3]
array1 = np.array(list1)
print(array1.shape)

(3,)

In [23]:
# 리스트를 이용해 DataFrame 생성

df_list1= pd.DataFrame(list1, columns=col_name1)
print(df_list1)

   col1
0     1
1     2
2     3

In [24]:
# 넘파이 ndarray를 이용해 DataFrame 생성

df_array1 = pd.DataFrame(array1, columns=col_name1)
print(df_array1)

   col1
0     1
1     2
2     3

In [26]:
# 2차원 형태의 데이터를 기반으로 DataFrame 생성

# 3개의 컬럼명이 필요
col_name2 = ['col1', 'col2', 'col3']

# 2행x3열 형태의 리스트와 ndarray 생성한 뒤 이를 DataFrame으로 변환
list2 = [[1,2,3], 
         [11,12,13]]
array2 = np.array(list2)
print(array2.shape)
print('--------------------')
df_list2 = pd.DataFrame(list2, columns=col_name2)
print(df_list2)
print('--------------------')
df_array2 = pd.DataFrame(array2, columns=col_name2)
print(df_array2)

(2, 3)
--------------------
   col1  col2  col3
0     1     2     3
1    11    12    13
--------------------
   col1  col2  col3
0     1     2     3
1    11    12    13

In [27]:
# 딕셔너리를 DataFrame으롤 변환
# 딕셔너리의 키(Key)는 컬럼명으로, 딕셔너리의 값(Value)은 키에 해당하는 컬럼 데이터로 변환

dict = {'col1':[1,11], 'col2':[2,22], 'col3':[3,33]}
df_dict = pd.DataFrame(dict)
print(df_dict)

   col1  col2  col3
0     1     2     3
1    11    22    33

## DataFrame을 넘파이 ndarray, 리스트, 딕셔너리로 변환하기

In [28]:
# DataFrame을 ndarray로 변환

array3 = df_dict.values
print(type(array3), array3.shape)
print(array3)

<class 'numpy.ndarray'> (2, 3)
[[ 1  2  3]
 [11 22 33]]

In [29]:
# DataFrame을 리스트로 변환

list3 = df_dict.values.tolist()
print(type(list3))
print(list3)

<class 'list'>
[[1, 2, 3], [11, 22, 33]]

In [30]:
# DataFrame을 딕셔너리로 변환

dict3 = df_dict.to_dict('list')   # 'list' : 리스트형으로 반환
print(type(dict3))
print(dict3)

<class 'dict'>
{'col1': [1, 11], 'col2': [2, 22], 'col3': [3, 33]}

# DataFrame의 컬럼 데이터 세트 생성과 수정

In [31]:
titanic_df['Age_0']=0
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0

In [32]:
titanic_df['Age_by_10'] = titanic_df['Age']*10
titanic_df['Family_No'] = titanic_df['SibSp'] + titanic_df['Parch'] + 1
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,220.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,380.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,260.0,1

In [33]:
titanic_df['Age_by_10'] = titanic_df['Age_by_10'] + 100
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,320.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,480.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,360.0,1

# DataFrame 데이터 삭제

DataFrame.drop(labels=None, axis=0, index=None, columns=None, level=None, inplace=False, errors='raise')

## axis=1 (열삭제)

axis 0 은 로우 방향 축(↓), axis 1 은 컬럼 방향 축(→)  
axis=0 은 행 삭제. 이상치 데이터를 삭제하는 경우에 주로 사용  
axis=1 은 열 삭제. 기존 컬럼 값을 가공해 새로운 컬럼을 만들고 삭제하는 경우 사용

In [34]:
titanic_drop_df = titanic_df.drop('Age_0', axis=1)
titanic_drop_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,320.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,480.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,360.0,1

## inplace

inplace 는 default 값이 False. 자기 자신의 DataFrame 의 데이터는 삭제하지 않으며, 삭제된 결과 DataFrame을 반환

In [35]:
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,320.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,480.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,360.0,1

In [36]:
drop_result = titanic_df.drop(['Age_0', 'Age_by_10', 'Family_No'], axis=1, inplace=True)
print(drop_result)
titanic_df.head(3)

None

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

위의 결과처럼 inplace=True로 설정하면 print(drop_result) 의 결과값이 None 이 된다.  
따라서 inplace=True 로 설정한 채로 반환 값을 다시 자신의 DataFrame 객체로 할당하면 안된다.

## axis=0 (행삭제)

In [37]:
pd.set_option('display.width', 1000)
pd.set_option('display.max_colwidth', 15)
print('#### before axis 0 drop ####')
print(titanic_df.head(3))

titanic_df.drop([0,1,2], axis=0, inplace=True)
print('#### after axis 0 drop ####')
print(titanic_df.head(3))

#### before axis 0 drop ####
   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S
#### after axis 0 drop ####
   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
3            4         1       1  Futrelle, M...  female  35.0      1      0  113803  53.1000  C123        S
4            5         0       3  Allen, Mr. ...    male  35.0      0      0  373450   8.0500   NaN        S
5            6         0       3  Moran, Mr. ...    male   NaN      0      0  330877   8.4583   NaN        Q

axis : DataFrame 의 로우를 삭제할때는 axis=0, 컬럼을 삭제할 때는 axis=1 으로 설정  

원본 DataFrame 은 유지하고 드롭된 DataFrame 을 새롭게 객체 변수로 받고 싶다면 inplace=False로 설정(default 값이 False)  
예: titanic_drop_df = titanic_df.drop('Age_0', axis=1, inplace=False)  

원본 DataFrame 에 드롭된 결과를 적용할 경우에는 inplace=True 를 적용   
예: titanic_df.drop('Age_0', axis=1, inplace=True)  

원본 DataFrame 에서 드롭된 DataFrame 을 다시 원본 DataFrame 객체 변수로 할당하면 원본 DataFrame 에서 드롭된 결과를 적용할 경우와 같음  
(단, 기존 원본 DataFrame 객체 변수는 메모리에서 추후 제거됨)  
예: titanic_df = titanic_df.drop('Age_0', axis=1, inplace=False)

# Index 객체

DataFrame, Series의 레코드를 고유하게 식별하는 객체

In [41]:
# 원본 파일 다시 로딩
titanic_df = pd.read_csv('C:\\Users\\jjku0\\OneDrive\\data\\titanic\\train.csv')

# Index 객체 추출
indexes = titanic_df.index
print(indexes)

# Index 객체를 실제 값 array로 변환
print(indexes.values)

RangeIndex(start=0, stop=891, step=1)
[  0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17
  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35
  36  37  38  39  40  41  42  43  44  45  46  47  48  49  50  51  52  53
  54  55  56  57  58  59  60  61  62  63  64  65  66  67  68  69  70  71
  72  73  74  75  76  77  78  79  80  81  82  83  84  85  86  87  88  89
  90  91  92  93  94  95  96  97  98  99 100 101 102 103 104 105 106 107
 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125
 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143
 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161
 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179
 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197
 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215
 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233
 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251
 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269
 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287
 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305
 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323
 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341
 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359
 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377
 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395
 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413
 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431
 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449
 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467
 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485
 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503
 504 505 506 507 508 509 510 511 512 513 514 515 516 517 518 519 520 521
 522 523 524 525 526 527 528 529 530 531 532 533 534 535 536 537 538 539
 540 541 542 543 544 545 546 547 548 549 550 551 552 553 554 555 556 557
 558 559 560 561 562 563 564 565 566 567 568 569 570 571 572 573 574 575
 576 577 578 579 580 581 582 583 584 585 586 587 588 589 590 591 592 593
 594 595 596 597 598 599 600 601 602 603 604 605 606 607 608 609 610 611
 612 613 614 615 616 617 618 619 620 621 622 623 624 625 626 627 628 629
 630 631 632 633 634 635 636 637 638 639 640 641 642 643 644 645 646 647
 648 649 650 651 652 653 654 655 656 657 658 659 660 661 662 663 664 665
 666 667 668 669 670 671 672 673 674 675 676 677 678 679 680 681 682 683
 684 685 686 687 688 689 690 691 692 693 694 695 696 697 698 699 700 701
 702 703 704 705 706 707 708 709 710 711 712 713 714 715 716 717 718 719
 720 721 722 723 724 725 726 727 728 729 730 731 732 733 734 735 736 737
 738 739 740 741 742 743 744 745 746 747 748 749 750 751 752 753 754 755
 756 757 758 759 760 761 762 763 764 765 766 767 768 769 770 771 772 773
 774 775 776 777 778 779 780 781 782 783 784 785 786 787 788 789 790 791
 792 793 794 795 796 797 798 799 800 801 802 803 804 805 806 807 808 809
 810 811 812 813 814 815 816 817 818 819 820 821 822 823 824 825 826 827
 828 829 830 831 832 833 834 835 836 837 838 839 840 841 842 843 844 845
 846 847 848 849 850 851 852 853 854 855 856 857 858 859 860 861 862 863
 864 865 866 867 868 869 870 871 872 873 874 875 876 877 878 879 880 881
 882 883 884 885 886 887 888 889 890]

In [42]:
# Index 객체는 식별성 데이터를 1차원 array로 가지고 있다.
# ndarray 와 유사하게 단일 값 반환 및 슬라이싱 가능

print(type(indexes.values))
print(indexes.values.shape)
print(indexes[:5].values)
print(indexes.values[:5])
print(indexes[6])

<class 'numpy.ndarray'>
(891,)
[0 1 2 3 4]
[0 1 2 3 4]
6

In [43]:
# 한 번 만들어진 DataFrame 및 Series 의 Index 객체는 함부로 변경할 수 없다.

indexes[0] = 5

TypeError: Index does not support mutable operations

In [46]:
# Series 객체는 Index 객체를 포함하지만 Series 객체에 연산 함수를 적용할 때 Index는 연산에서 제외
# Index 는 오직 식별용

series_fair = titanic_df['Fare']
series_fair

0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
886    13.0000
887    30.0000
888    23.4500
889    30.0000
890     7.7500
Name: Fare, Length: 891, dtype: float64

In [47]:
print(series_fair.max())
print(series_fair.sum())
print(sum(series_fair))
print((series_fair+3).head(3))  # 각각의 데이터에 + 3

512.3292
28693.9493
28693.949299999967
0    10.2500
1    74.2833
2    10.9250
Name: Fare, dtype: float64

## reset_index()

DataFrame 및 Series 에 reset_index() 메서드를 수행하면 새롭게 인덱스를 연속 숫자 형으로 할당하며 기존 인덱스는 'index' 라는 새로운 컬럼 명으로 추가  
reset_index()는 인덱스가 연속된 int 숫자형 데이터가 아닐 경우에 다시 이를 연속 int 숫자형 데이터로 만들 때 주로 사용  
Series 에 reset_index()를 적용하면 Series 가 아닌 DataFrame 이 반환  
기존 인덱스가 컬럼으로 추가돼 컬럼이 2개가 되므로 Series 가 아닌 DataFrame 이 반환  
파라미터 drop=True 로 설정하면 기존 인덱스는 새로운 컬럼으로 추가되지 않고 삭제(drop)

In [48]:
titanic_reset_df = titanic_df.reset_index(inplace=False)
titanic_reset_df.head(3)

   index  PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0      0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1      1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2      2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S

In [55]:
print("### before reset_index ###")
value_counts = titanic_df['Pclass'].value_counts()
print(value_counts)
print(type(value_counts))
new_value_counts = value_counts.reset_index(inplace=False)
print("### after reset_index ###")
print(new_value_counts)
print(type(new_value_counts))

### before reset_index ###
3    491
1    216
2    184
Name: Pclass, dtype: int64
<class 'pandas.core.series.Series'>
### after reset_index ###
   index  Pclass
0      3     491
1      1     216
2      2     184
<class 'pandas.core.frame.DataFrame'>

# 데이터 셀렉션 및 필터링

판다스의 데이터 셀렉션과 필터링은 넘파이와 상당히 유사한 부분도 있고 다른 부분도 있기에 사용할때마다 혼동하기 쉽다.  
판다스의 DataFrame 과 Series 끼리도 이러한 데이터 셀렉션 기능이 달라지는 부분이 있어 주의가 필요  
넘파이의 경우 '[]' 연산자 내 단일 값 추출, 슬라이싱, 팬시 인덱싱, 불린 인덱싱을 통해 데이터를 추출  
판다스의 경우 ix[], iloc[], loc[] 연산자를 통해 동일한 작업을 수행

## DataFrame 의 [] 연산자

넘파이와 DataFrame 간 데이터 셀렉션에서 가장 유의해야 할 부분은 '[]' 연산자  
넘파이에서 [] 연산자는 행의 위치, 열의 위치, 슬라이싱 범위 등을 지정해 데이터를 가져올 수 있다.  
하지만 DataFrame 바로 뒤에 있는 '[]' 안에 들어갈 수 있는 것은 컬럼 명 문자(또는 컬럼 명의 리스트 객체), 또는 인덱스로 변환 가능한 표현식  
DataFrame 뒤에 있는 []는 컬럼만 지정할 수 있는 '컬럼 지정 연산자'로 이해  
DataFrame['컬럼명']

In [56]:
print(titanic_df['Pclass'].head(3))
print(titanic_df[['Survived', 'Pclass']].head(3))
print(titanic_df[0]) # 오류 발생. 0 은 컬럼 명이 아니기 때문

0    3
1    1
2    3
Name: Pclass, dtype: int64
   Survived  Pclass
0         0       3
1         1       1
2         1       3

KeyError: 0

In [57]:
# 판다스의 인덱스 형태로 변환 가능한 표현식은 [] 내에 입력할 수 있다. ex) 슬라이싱, 불린 인덱싱 표현 등

titanic_df[0:2]

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch     Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0  A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0   PC 17599  71.2833   C85        C

In [58]:
titanic_df[titanic_df['Pclass'] == 3].head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket   Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171  7.250   NaN        S
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...  7.925   NaN        S
4            5         0       3  Allen, Mr. ...    male  35.0      0      0          373450  8.050   NaN        S

DataFrame 바로 뒤의 [] 연산자는 넘파이의 [] 나 Series 의 [] 와 다르다.  

DataFrame 바로 뒤의 [] 내 입력 값은 컬럼명(또는 컬럼의 리스트)을 지정해 컬럼 지정 연산에 사용하거나 불린 인덱스 용도로만 사용해야 한다.  

DataFrame[0:2] 와 같은 슬라이싱 연산으로 데이터를 추출하는 방법은 사용하지 않는 게 좋다.

## DataFrame ix[] 연산자

ix[] 는 ix[0, 'Pclass'] 와 같이 행 위치 지정으로 인덱스 값 0, 열 위치 지정으로 컬럼 명인 'Pclass'를 입력해 원하는 위치의 데이터를 추출할 수 있다.  
ix[] 의 행에 해당하는 위치 지정은 DataFrame 의 인덱스 값을 입력해야 한다.  
열 위치 지정은 약간 독특하게도 컬럼 명 뿐만 아니라 ix[0,2] 와 같이 컬럼명이 아닌 컬럼의 위치 값 지정도 가능하다.  
ix[] 연산자는 컬럼 명칭 기반 인덱싱과 컬럼 위치 기반 인덱싱 두가지 방식을 모두 제공하게 되면서 코드가 혼돈을 주거나 가독성이 떨어지면서 ix[] 는 현재 판다스에서 사라지게 되었다.  
그리고 이를 대신할 컬럼 명칭 기반 인덱싱 연산자인 loc[] 와 컬럼 위치 기반 인덱싱 연산자인 iloc[] 가 새롭게 만들어졌다.

In [59]:
print(titanic_df.ix[0,2])
print(titanic_df.ix[0, 'Pclass'])

AttributeError: 'DataFrame' object has no attribute 'ix'

In [60]:
data = {'Name' : ['Chulmin', 'Eunkyung', 'Jinwoong', 'Soobeom'],
       'Year' : [2011, 2016, 2015, 2015],
       'Gender' : ['Male', 'Female', 'Male', 'Male']}
data_df = pd.DataFrame(data, index=['one', 'two', 'three', 'four'])
data_df

           Name  Year  Gender
one     Chulmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male

In [63]:
# data_df 를 reset_index()로 새로운 숫자형 인덱스를 생성

data_df_reset = data_df.reset_index()
data_df_reset = data_df_reset.rename(columns={'index':'old_index'})

# 인덱스값에 1을 더해서 1부터 시작하는 새로운 인덱스값 생성

data_df_reset.index = data_df_reset.index+1
data_df_reset

  old_index      Name  Year  Gender
1       one   Chulmin  2011    Male
2       two  Eunkyung  2016  Female
3     three  Jinwoong  2015    Male
4      four   Soobeom  2015    Male

## DataFrame iloc[] 연산자

iloc[] 는 위치 기반 인덱싱만 허용하기 때문에 행과 열 값으로 integer 또는 integer 형의 슬라이싱, 팬시 리스트 값을 입력해줘야 한다.  
슬라이싱과 팬시 인덱싱은 제공하나 명확한 위치 기반 인덱싱이 사용되어야 하는 제약으로 인해 불린 인덱싱은 제공하지 않는다.

In [62]:
data_df.iloc[0,0]

'Chulmin'

In [64]:
# iloc[] 에 위치 인덱싱이 아닌 명칭을 입력하면 오류가 발생

data_df.iloc[0, 'Name']

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [65]:
# 문자열 인덱스를 행 위치에 입력해도 오류가 발생

data_df.iloc['one', 0]

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [66]:
data_df_reset.iloc[0,1]

'Chulmin'

## DataFrame loc[] 연산자

loc[] 는 명칭 기반으로 데이터를 추출한다. 행 위치에는 DataFrame index 값을, 열 위치에는 컬럼 명을 입력

In [67]:
data_df.loc['one', 'Name']

'Chulmin'

In [69]:
# index 가 숫자 형일 수 있기 때문에 명칭 기반이라고 무조건 문자열을 입력한다는 선입견을 가져서는 안된다.

data_df_reset.loc[1, 'Name']

'Chulmin'

In [70]:
# 인덱스 값이 0인 행이 없으므로 오류를 반환

data_df_reset.loc[0, 'Name']

KeyError: 0

loc[] 에 슬라이싱 기호 ':' 를 적용 할 때 유의할 점  
일반적으로 슬라이싱을 '시작 값:종료 값' 과 같이 지정하면 시작 값 ~ 종료 값-1 까지의 범위를 의미  
그런데 loc[] 에 슬라이싱 기호를 적용하면 종료 값-1 이 아니라 종료 값까지 포함하는 것을 의미  
명칭 기반 인덱싱의 특성. 명칭은 숫자 형이 아닐 수 있기 때문에 -1을 할 수 없다.

In [71]:
print(data_df.iloc[0:1, 0])  # 위치 기반

one    Chulmin
Name: Name, dtype: object

In [73]:
print(data_df.loc['one':'two', 'Name'])  # 명칭 기반

one     Chulmin
two    Eunkyung
Name: Name, dtype: object

In [74]:
print(data_df_reset.loc[1:2, 'Name'])

1     Chulmin
2    Eunkyung
Name: Name, dtype: object

가장 중요한 것은 명칭 기반 인덱싱과 위치 기반 인덱싱의 차이를 이해하는 것이다. DataFrame 의 인덱스나 컬럼명으로 데이터에 접근하는 것은 명칭 기반 인덱싱이다. 0 부터 시작하는 행, 열의 위치 좌표에만 의존하는 것이 위치 기반 인덱싱이다.  

iloc[] 는 위치 기반 인덱싱만 가능하다. 따라서 행과 열 위치 값으로 정수형 값을 지정해 원하는 데이터를 반환한다.  

loc[] 는 명칭 기반 인덱싱만 가능하다. 따라서 행 위치에 DataFrame 인덱스가 오며, 열 위치에는 컬럼 명을 지정해 원하는 데이터를 반환한다.  

명칭 기반 인덱싱에서 슬라이싱을 '시작점:종료점'으로 지정할 때 시작점에서 종료점을 포함한 위치에 있는 데이터를 반환한다.

## 불린 인덱싱

어느 정도 DataFrame 에 익숙해지면 iloc, loc 보다는 불린 인덱싱을 주로 사용하게 된다.  
불린 인덱싱은 매우 편리한 데이터 필터링 방식이다. 오히려 iloc, loc 와 같이 명확히 인덱싱을 지정하는 방식보다는 불린 인덱싱에 의존해 데이터를 가져오는 경우가 더 많다. 왜냐하면 명칭이나 위치 지정 인덱싱에서 가져올 값은 주로 로직이나 조건에 의해 계산한 뒤에 행 위치, 열 위치 값으로 입력되는데, 그럴 필요 없이 처음부터 가져올 값을 조건으로 입력하면 자동으로 원하는 값을 필터링하기 때문이다.  
iloc[] 는 정수형 값이 아닌 불린 값에 대해서는 지원을 하지 않기 때문에 불린 인덱싱이 지원되지 않는다.

In [75]:
titanic_df = pd.read_csv('C:\\Users\\jjku0\\OneDrive\\data\\titanic\\train.csv')
titanic_boolean = titanic_df[titanic_df['Age'] > 60]  # Age 컬럼 값이 60 보다 큰 데이터를 모두 반환
print(type(titanic_boolean))
titanic_boolean

<class 'pandas.core.frame.DataFrame'>

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch       Ticket      Fare        Cabin Embarked
33            34         0       2  Wheadon, Mr...    male  66.0      0      0   C.A. 24579   10.5000          NaN        S
54            55         0       1  Ostby, Mr. ...    male  65.0      0      1       113509   61.9792          B30        C
96            97         0       1  Goldschmidt...    male  71.0      0      0     PC 17754   34.6542           A5        C
116          117         0       3  Connors, Mr...    male  70.5      0      0       370369    7.7500          NaN        Q
170          171         0       1  Van der hoe...    male  61.0      0      0       111240   33.5000          B19        S
252          253         0       1  Stead, Mr. ...    male  62.0      0      0       113514   26.5500          C87        S
275          276         1       1  Andrews, Mi...  female  63.0      1      0        13502   77.9583           D7        S
280          281         0       3  Duane, Mr. ...    male  65.0      0      0       336439    7.7500          NaN        Q
326          327         0       3  Nysveen, Mr...    male  61.0      0      0       345364    6.2375          NaN        S
438          439         0       1  Fortune, Mr...    male  64.0      1      4        19950  263.0000  C23 C25 C27        S
456          457         0       1  Millet, Mr....    male  65.0      0      0        13509   26.5500          E38        S
483          484         1       3  Turkula, Mr...  female  63.0      0      0         4134    9.5875          NaN        S
493          494         0       1  Artagaveyti...    male  71.0      0      0     PC 17609   49.5042          NaN        C
545          546         0       1  Nicholson, ...    male  64.0      0      0          693   26.0000          NaN        S
555          556         0       1  Wright, Mr....    male  62.0      0      0       113807   26.5500          NaN        S
570          571         1       2  Harris, Mr....    male  62.0      0      0  S.W./PP 752   10.5000          NaN        S
625          626         0       1  Sutton, Mr....    male  61.0      0      0        36963   32.3208          D50        S
630          631         1       1  Barkworth, ...    male  80.0      0      0        27042   30.0000          A23        S
672          673         0       2  Mitchell, M...    male  70.0      0      0   C.A. 24580   10.5000          NaN        S
745          746         0       1  Crosby, Cap...    male  70.0      1      1    WE/P 5735   71.0000          B22        S
829          830         1       1  Stone, Mrs....  female  62.0      0      0       113572   80.0000          B28      NaN
851          852         0       3  Svensson, M...    male  74.0      0      0       347060    7.7750          NaN        S

In [78]:
# 60세 이상인 승객의 나이와 이름만 추출

titanic_df[titanic_df['Age'] > 60][['Name', 'Age']].head(3)

              Name   Age
33  Wheadon, Mr...  66.0
54  Ostby, Mr. ...  65.0
96  Goldschmidt...  71.0

In [79]:
titanic_df.loc[titanic_df['Age'] > 60, ['Name', 'Age']].head(3)

              Name   Age
33  Wheadon, Mr...  66.0
54  Ostby, Mr. ...  65.0
96  Goldschmidt...  71.0

and 조건일 때는 &  
or 조건일 때는 |  
Not 조건일 때는 ~

In [80]:
# 나이가 60세가 넘고, 선실 등급이 1등급이며, 성별이 여성인 승객을 추출

titanic_df[(titanic_df['Age'] > 60) & (titanic_df['Pclass'] == 1) & (titanic_df['Sex'] == 'female')]

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
275          276         1       1  Andrews, Mi...  female  63.0      1      0   13502  77.9583    D7        S
829          830         1       1  Stone, Mrs....  female  62.0      0      0  113572  80.0000   B28      NaN

In [81]:
cond1 = titanic_df['Age'] > 60
cond2 = titanic_df['Pclass'] == 1
cond3 = titanic_df['Sex'] == 'female'
titanic_df[cond1 & cond2 & cond3]

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
275          276         1       1  Andrews, Mi...  female  63.0      1      0   13502  77.9583    D7        S
829          830         1       1  Stone, Mrs....  female  62.0      0      0  113572  80.0000   B28      NaN

# 정렬, Aggregation 함수, GroupBy 적용

## DataFrame, Series의 정렬 - sort_values()

RDBMS SQL의 order by 키워드와 매우 유사하다.  
주요 입력 파라미터  
by : 특정 컬럼을 입력하면 해당 컬럼으로 정렬을 수행  
ascending : True 로 설정하면 오름차순 정렬, False 로 설정하면 내림차순으로 정렬. default 는 True.  
inplace : Fasle 로 설정하면 sort_values()를 호출한 DataFrame 은 그대로 유지하며 정렬된 DataFrame 을 결과로 반환,  
True 로 설정하면 호출한 DataFrame의 정렬 결과를 그대로 적용한다. default 는 False.

In [82]:
titanic_sorted = titanic_df.sort_values(by=['Name'])
titanic_sorted.head(3)

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch     Ticket   Fare Cabin Embarked
845          846         0       3  Abbing, Mr....    male  42.0      0      0  C.A. 5547   7.55   NaN        S
746          747         0       3  Abbott, Mr....    male  16.0      1      1  C.A. 2673  20.25   NaN        S
279          280         1       3  Abbott, Mrs...  female  35.0      1      1  C.A. 2673  20.25   NaN        S

In [83]:
titanic_sorted = titanic_df.sort_values(by=['Pclass', 'Name'], ascending=False)  # 내림차순 정렬
titanic_sorted.head(3)

     PassengerId  Survived  Pclass            Name   Sex   Age  SibSp  Parch    Ticket  Fare Cabin Embarked
868          869         0       3  van Melkebe...  male   NaN      0      0    345777   9.5   NaN        S
153          154         0       3  van Billiar...  male  40.5      0      2  A/5. 851  14.5   NaN        S
282          283         0       3  de Pelsmaek...  male  16.0      0      0    345778   9.5   NaN        S

## Aggregation 함수 적용(집계함수)

DataFrame 에서 min(), max(), sum(), count() 와 같은 aggregation 함수의 적용은 RDBMS SQL의 aggregation 함수 적용과 유사하다.  
다만 DataFrame 의 경우 DataFrame 에서 바로 aggregation 을 호출할 경우 모든 컬럼에 해당 aggregation 을 적용한다는 차이가 있다.

In [84]:
titanic_df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [85]:
titanic_df[['Age', 'Fare']].mean()  # 특정 컬럼에만 적용

Age     29.699118
Fare    32.204208
dtype: float64

## groupby() 적용

DataFrame 의 groupby() 는 RDBMS SQL의 groupby 키워드와 유사하면서도 다른 면이 있기 때문에 주의가 필요하다.  
SQL 판다스 모두 groupby 를 분석 작업에 매우 많이 활용한다.  
입력 파라미터 by 에 컬럼을 입력하면 대성 컬럼으로 groupby 된다.  
DataFrame 에 groupby() 를 호출하면 DataFrameGroupBy 라는 또 다른 형태의 DataFrame 을 반환한다.

In [86]:
titanic_groupby = titanic_df.groupby(by='Pclass')
print(type(titanic_groupby))

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

SQL 의 group by 와 다르게, DataFrame 에 groupby() 를 호출해 반환된 결과에 aggregation 함수를 호출하면 groupby() 대상 컬럼을 제외한 모든 컬럼에 해당 aggregation 함수를 적용한다.

In [87]:
titanic_groupby = titanic_df.groupby('Pclass').count()
titanic_groupby

        PassengerId  Survived  Name  Sex  Age  SibSp  Parch  Ticket  Fare  Cabin  Embarked
Pclass
1               216       216   216  216  186    216    216     216   216    176       214
2               184       184   184  184  173    184    184     184   184     16       184
3               491       491   491  491  355    491    491     491   491     12       491

DataFrame 의 groupby() 에 특정 컬럼만 aggregation 함수를 적용하려면 groupby()로 반환된 DataFrameGroupBy 객체에 해당 컬럼을 필터링한 뒤 aggregation 함수를 적용한다.

In [88]:
titanic_groupby = titanic_df.groupby('Pclass')[['PassengerId', 'Survived']].count()
titanic_groupby

        PassengerId  Survived
Pclass
1               216       216
2               184       184
3               491       491

DataFrame groupby() 와 SQL 의 group by 키워드의 또 다른 차이는 SQL 의 경우 서로 다른 aggregation 함수를 적용할 경우에는 Select 절에 나열하기만 하면 되지만, DataFrame groupby() 의 경우 적용하려는 여러 개의 aggregation 함수명을 DataFrameGroupBy 객체의 agg() 내에 인자로 입력해서 사용한다는 점이다.

In [89]:
titanic_df.groupby('Pclass')['Age'].agg([max, min])

         max   min
Pclass
1       80.0  0.92
2       70.0  0.67
3       74.0  0.42

그런데 이렇게 DataFrame 의 groupby() 를 이용해 API 기반으로 처리하다 보니 SQL 의 group by 보다 유연성이 떨어질 수밖에 없다.  
예를 들어 여러 개의 컬럼이 서로 다른 aggregation 함수를 groupby 에서 호출하려면 SQL 은 Select max(Age), sum(SibSP), avg(Fare) from titanic_table group by Pclass 와 같이 쉽게 가능하지만, DataFrame groupby() 는 좀 더 복잡한 처리가 필요하다.  
groupby() 는 agg() 를 이용해 이 같은 처리가 가능한데, agg() 내에 입력 값으로 딕셔너리 형태로 aggregation 이 적용될 컬럼들과 aggregation 함수를 입력한다.

In [90]:
agg_format={'Age':'max', 'SibSp':'sum', 'Fare':'mean'}
titanic_df.groupby('Pclass').agg(agg_format)

         Age  SibSp       Fare
Pclass
1       80.0     90  84.154687
2       70.0     74  20.662183
3       74.0    302  13.675550

# 결손 데이터 처리하기

판다스는 결손 데이터(Missing Data) 를 처리하는 편리한 API 를 제공한다. 결손 데이터는 컬럼에 값이 없는, 즉 NULL 인 경우를 의미하며, 리를 넘파이의 NaN 으로 표시한다. 기본적으로 머신러닝 알고리즘은 이 NaN 값을 처리하지 않으므로 이 값을 다른 값으로 대체해야 한다. 또한 NaN 값은 평균, 총합 등의 함수 연산 시 제외가 된다.  
isna() : NaN 여부를 확인하는 API  
fillna() : NaN 값을 다른 값으로 대체하는 API

## isna() 로 결손 데이터 여부 확인

In [92]:
titanic_df.isna().head(3)  # True 값이 NaN

   PassengerId  Survived  Pclass   Name    Sex    Age  SibSp  Parch  Ticket   Fare  Cabin  Embarked
0        False     False   False  False  False  False  False  False   False  False   True     False
1        False     False   False  False  False  False  False  False   False  False  False     False
2        False     False   False  False  False  False  False  False   False  False   True     False

In [93]:
titanic_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

## fillna() 로 결손 데이터 대체하기

fillna() 를 이용해 반환 값을 다시 받거나 inplace=True 파라미터를 fillna() 에 추가해야 실제 데이터 세트 값이 변경된다.

In [94]:
titanic_df['Cabin'] = titanic_df['Cabin'].fillna('C000')
titanic_df.head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500  C000        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250  C000        S

In [97]:
titanic_df['Age'] = titanic_df['Age'].fillna(titanic_df['Age'].mean())
titanic_df['Embarked'] = titanic_df['Embarked'].fillna('S')
titanic_df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

# apply lambda 식으로 데이터 가공

판다스는 apply 함수에 lambda 식을 결합해 DataFrame 이나 Series 의 레코드별로 데이터를 가공하는 기능을 제공한다.  
판다스의 경우 컬럼에 일괄적으로 데이터 가공을 하는 것이 속도 면에서 더 빠르나 복잡한 데이터 가공이 필요할 경우 어쩔 수 없이 apply lambda 를 이용한다.  
labmda 는 함수의 선언과 함수 내의 처리를 한 줄의 식으로 쉽게 변환하는 식이다.

In [98]:
def get_square(a):
    return a**2

print('3의 제곱은:', get_square(3))

3의 제곱은: 9

In [99]:
lambda_sqaure = lambda x : x ** 2
print('3의 제곱은:', lambda_sqaure(3))

3의 제곱은: 9

labmda 식을 이용할 때 여러 개의 값을 입력 인자로 사용해야 할 경우 보통 map() 함수를 결합해서 사용한다.

In [100]:
a = [1,2,3]
squares = map(lambda x : x**2, a)
list(squares)

[1, 4, 9]

In [102]:
titanic_df['Name_len'] = titanic_df['Name'].apply(lambda x : len(x))
titanic_df[['Name', 'Name_len']].head(3)

             Name  Name_len
0  Braund, Mr....        23
1  Cumings, Mr...        51
2  Heikkinen, ...        22

In [103]:
titanic_df['Child_Adult'] = titanic_df['Age'].apply(lambda x : 'Child' if x <= 15 else 'Adult')
titanic_df[['Age', 'Child_Adult']].head(8)

# if 절의 경우 if 식보다 반환 값을 먼저 기술해야 한다.
# else if 는 지원하지 않는다.

         Age Child_Adult
0  22.000000       Adult
1  38.000000       Adult
2  26.000000       Adult
3  35.000000       Adult
4  35.000000       Adult
5  29.699118       Adult
6  54.000000       Adult
7   2.000000       Child

In [104]:
# 나이가 15세 이하이면 Child, 15 ~ 60세 사이는 Adult, 61세 이상은 Elderly로 분류

titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x : 'Child' if x <= 15 else ('Adult' if x <= 60 else 'Elderly'))
titanic_df['Age_cat'].value_counts()

Adult      786
Child       83
Elderly     22
Name: Age_cat, dtype: int64

In [105]:
# 나이에 따라 더 세분화된 분류
# 5살 이하는 Baby, 12살 이하는 Child, 18살 이하는 Teenage, 25살 이하는 Student, 
#35살 이하는 Young Adult, 60세 이하는 Adult, 그리고 그 이상은 Elderly로 분류

def get_category(age):
    cat = ''
    if age <= 5 : cat = 'Baby'
    elif age <= 12 : cat = 'Child'
    elif age <= 18 : cat = 'Teenager'
    elif age <= 25 : cat = 'Student'
    elif age <= 35 : cat = 'Young Adult'
    elif age <= 60 : cat = 'Adult'
    else : cat = 'Elderly'
        
    return cat

# lambda 식에 위에서 생성한 get_category() 함수를 반환값으로 지정.
# get_category(X)는 입력값으로 'Age' 칼럼 값을 받아서 해당하는 cat 반환

titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x : get_category(x))
titanic_df[['Age', 'Age_cat']].head()

    Age      Age_cat
0  22.0      Student
1  38.0        Adult
2  26.0  Young Adult
3  35.0  Young Adult
4  35.0  Young Adult

참고:  

if 조건1:
    실행코드1
elif 조건2:
    실행코드2
elif 조건3:
    실행코드3
      :
else:  
    실행코드4